<!doctype html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<meta name="generator" content="Docusaurus v2.0.0-alpha.70">
<link rel="alternate" type="application/rss+xml" href="/blog/rss.xml" title="Memgraph Docs Blog RSS Feed">
<link rel="alternate" type="application/atom+xml" href="/blog/atom.xml" title="Memgraph Docs Blog Atom Feed">
<link rel="search" type="application/opensearchdescription+xml" title="Memgraph Docs" href="/opensearch.xml">
<script src="https://docs.memgraph.com/js/analytics.js"></script><title data-react-helmet="true">MATCH clause | Memgraph Docs</title><meta data-react-helmet="true" name="twitter:card" content="summary_large_image"><meta data-react-helmet="true" name="docsearch:language" content="en"><meta data-react-helmet="true" name="docsearch:version" content="current"><meta data-react-helmet="true" name="docsearch:docusaurus_tag" content="docs-cypher-manual-current"><meta data-react-helmet="true" property="og:title" content="MATCH clause | Memgraph Docs"><meta data-react-helmet="true" name="description" content="The MATCH clause is used to obtain data from the database by matching it to a given pattern."><meta data-react-helmet="true" property="og:description" content="The MATCH clause is used to obtain data from the database by matching it to a given pattern."><meta data-react-helmet="true" property="og:url" content="https://docs.memgraph.com/cypher-manual/clauses/match"><link data-react-helmet="true" rel="shortcut icon" href="/img/social-logo-round-corners.png"><link data-react-helmet="true" rel="preconnect" href="https://BH4D9OD16A-dsn.algolia.net" crossorigin="anonymous"><link data-react-helmet="true" rel="canonical" href="https://docs.memgraph.com/cypher-manual/clauses/match"><link rel="stylesheet" href="/styles.8ace48be.css">
<link rel="preload" href="/styles.06f88032.js" as="script">
<link rel="preload" href="/runtime~main.709d9e6c.js" as="script">
<link rel="preload" href="/main.afc0a334.js" as="script">
<link rel="preload" href="/1.0ef0cd43.js" as="script">
<link rel="preload" href="/2.cec97469.js" as="script">
<link rel="preload" href="/123.885e8308.js" as="script">
<link rel="preload" href="/126.8348d2a6.js" as="script">
<link rel="preload" href="/08713178.0c1b649c.js" as="script">
<link rel="preload" href="/17896441.a596db69.js" as="script">
<link rel="preload" href="/70ee916e.41e7ce23.js" as="script">
</head>
<body>
<script>!function(){function t(t){document.documentElement.setAttribute("data-theme",t)}var e=function(){var t=null;try{t=localStorage.getItem("theme")}catch(t){}return t}();t(null!==e?e:"light")}()</script><div id="__docusaurus">
<nav aria-label="Skip navigation links"><button type="button" tabindex="0" class="skipToContent_11B0">Skip to main content</button></nav><nav class="navbar navbar--fixed-top"><div class="navbar__inner"><div class="navbar__items"><div aria-label="Navigation bar toggle" class="navbar__toggle" role="button" tabindex="0"><svg aria-label="Menu" width="30" height="30" viewBox="0 0 30 30" role="img" focusable="false"><title>Menu</title><path stroke="currentColor" stroke-linecap="round" stroke-miterlimit="10" stroke-width="2" d="M4 7h22M4 15h22M4 23h22"></path></svg></div><a class="navbar__brand" href="/"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--light_3CMI navbar__logo"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--dark_3ARp navbar__logo"><strong class="navbar__title">Docs</strong></a><div class="navbar__item dropdown dropdown--hoverable dropdown--left"><a class="navbar__item navbar__link" href="/memgraph/overview">Memgraph DB</a><ul class="dropdown__menu"><li><a class="dropdown__link" href="/memgraph/getting-started">Getting started</a></li><li><a class="dropdown__link" href="/memgraph/getting-started/installation">Installation</a></li><li><a class="dropdown__link" href="/memgraph/database-functionalities">Database functionalities</a></li><li><a class="dropdown__link" href="/memgraph/getting-started/connecting-applications">Building applications</a></li><li><a class="dropdown__link" href="/memgraph/reference-guide">Reference guide</a></li></ul></div><a class="navbar__item navbar__link" href="/memgraph-lab/">Memgraph Lab</a><a class="navbar__item navbar__link" href="/memgraph-cloud/">Memgraph Cloud</a><div class="navbar__item dropdown dropdown--hoverable dropdown--left"><a aria-current="page" class="navbar__item navbar__link navbar__link--active" href="/cypher-manual/">Cypher manual</a><ul class="dropdown__menu"><li><a aria-current="page" class="dropdown__link dropdown__link--active" href="/cypher-manual/">Overview</a></li><li><a class="dropdown__link" href="/cypher-manual/functions">Functions</a></li><li><a aria-current="page" class="dropdown__link dropdown__link--active" href="/cypher-manual/clauses">Clauses</a></li><li><a class="dropdown__link" href="/cypher-manual/other-features">Other features</a></li><li><a class="dropdown__link" href="/cypher-manual/differences">Differences</a></li></ul></div></div><div class="navbar__items navbar__items--right"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="navbar__item navbar__link">GitHub</a><div class="react-toggle react-toggle--disabled displayOnlyInLargeViewport_2N3Q"><div class="react-toggle-track"><div class="react-toggle-track-check"><span class="toggle_3NWk">🌜</span></div><div class="react-toggle-track-x"><span class="toggle_3NWk">🌞</span></div></div><div class="react-toggle-thumb"></div><input type="checkbox" disabled="" aria-label="Dark mode toggle" class="react-toggle-screenreader-only"></div><button type="button" class="DocSearch DocSearch-Button" aria-label="Search"><span class="DocSearch-Button-Container"><svg width="20" height="20" class="DocSearch-Search-Icon" viewBox="0 0 20 20"><path d="M14.386 14.386l4.0877 4.0877-4.0877-4.0877c-2.9418 2.9419-7.7115 2.9419-10.6533 0-2.9419-2.9418-2.9419-7.7115 0-10.6533 2.9418-2.9419 7.7115-2.9419 10.6533 0 2.9419 2.9418 2.9419 7.7115 0 10.6533z" stroke="currentColor" fill="none" fill-rule="evenodd" stroke-linecap="round" stroke-linejoin="round"></path></svg><span class="DocSearch-Button-Placeholder">Search</span></span></button></div></div><div role="presentation" class="navbar-sidebar__backdrop"></div><div class="navbar-sidebar"><div class="navbar-sidebar__brand"><a class="navbar__brand" href="/"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--light_3CMI navbar__logo"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--dark_3ARp navbar__logo"><strong class="navbar__title">Docs</strong></a></div><div class="navbar-sidebar__items"><div class="menu"><ul class="menu__list"><li class="menu__list-item menu__list-item--collapsed"><a class="menu__link menu__link--sublist" role="button" href="/memgraph/overview">Memgraph DB</a><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started">Getting started</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started/installation">Installation</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/database-functionalities">Database functionalities</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started/connecting-applications">Building applications</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/reference-guide">Reference guide</a></li></ul></li><li class="menu__list-item"><a class="menu__link" href="/memgraph-lab/">Memgraph Lab</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph-cloud/">Memgraph Cloud</a></li><li class="menu__list-item menu__list-item--collapsed"><a aria-current="page" class="menu__link menu__link--sublist navbar__link--active" role="button" href="/cypher-manual/">Cypher manual</a><ul class="menu__list"><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active" href="/cypher-manual/">Overview</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/functions">Functions</a></li><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active" href="/cypher-manual/clauses">Clauses</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/other-features">Other features</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/differences">Differences</a></li></ul></li><li class="menu__list-item"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="menu__link">GitHub</a></li></ul></div></div></div></nav><div class="main-wrapper"><div class="docPage_vMrn"><div class="docSidebarContainer_3Ak5" role="complementary"><div class="sidebar_3gvy"><div class="menu menu--responsive thin-scrollbar menu_1yIk"><button aria-label="Open Menu" aria-haspopup="true" class="button button--secondary button--sm menu__button" type="button"><svg aria-label="Menu" class="sidebarMenuIcon_1CUI" width="24" height="24" viewBox="0 0 30 30" role="img" focusable="false"><title>Menu</title><path stroke="currentColor" stroke-linecap="round" stroke-miterlimit="10" stroke-width="2" d="M4 7h22M4 15h22M4 23h22"></path></svg></button><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/">Overview</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/reading-existing-data">Reading existing data</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/writing-new-data">Writing new data</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/reading-and-writing">Reading and writing</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/functions">Functions</a></li><li class="menu__list-item"><a class="menu__link menu__link--sublist menu__link--active" href="#!">Clauses</a><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses">Clauses overview</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/create">CREATE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/delete">DELETE</a></li><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active active" tabindex="0" href="/cypher-manual/clauses/match">MATCH</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/merge">MERGE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/optional-match">OPTIONAL MATCH</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/remove">REMOVE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/return">RETURN</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/set">SET</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/union">UNION</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/unwind">UNWIND</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/where">WHERE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/with">WITH</a></li></ul></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/other-features">Other features</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/differences">Differences</a></li></ul></div></div></div><main class="docMainContainer_2iGs"><div class="container padding-vert--lg docItemWrapper_1bxp"><div class="row"><div class="col docItemCol_U38p"><div class="docItemContainer_a7m4"><article><header><h1 class="docTitle_Oumm">MATCH clause</h1></header><div class="markdown"><p>The <code>MATCH</code> clause is used to obtain data from the database by matching it to a given pattern.</p><ol><li><a href="#1-matching-nodes">Matching nodes</a><ol><li><a href="#11-get-all-nodes">Get all nodes</a></li><li><a href="#12-get-all-nodes-with-a-label">Get all nodes with a label</a></li></ol></li><li><a href="#2-matching-relationships">Matching relationships</a><ol><li><a href="#21-get-all-related-nodes">Get all related nodes</a></li><li><a href="#22-get-related-nodes-with-a-label">Get related nodes with a label</a></li><li><a href="#23-get-related-nodes-with-a-directed-relationship">Get related nodes with a directed relationship</a></li><li><a href="#24-get-a-relationship">Get a relationship</a></li><li><a href="#25-matching-on-a-relationship-with-a-type">Matching on a relationship with a type</a></li><li><a href="#26-matching-on-relationships-with-multiple-types">Matching on relationships with multiple types</a></li><li><a href="#27-uncommon-characters-in-relationship-types">Uncommon characters in relationship types</a></li><li><a href="#28-match-with-multiple-relationships">Match with multiple relationships</a></li></ol></li><li><a href="#3-matching-with-variable-length-relationships">Matching with variable length relationships</a><ol><li><a href="#31-variable-length-relationships">Variable length relationships</a></li><li><a href="#32-variable-length-relationships-with-multiple-relationship-types">Variable length relationships with multiple relationship types</a></li><li><a href="#33-returning-multiple-relationships-with-variable-length">Returning multiple relationships with variable length</a></li></ol></li></ol><h2 id="data-set">Data Set</h2><p>The following examples are executed with this data set. You can create this data set
locally by executing the queries at the end of the page: <a href="#data-set-queries">Data Set</a>.</p><img src="https://raw.githubusercontent.com/g-despot/images/master/data_set.png" alt="Data set" style="height:380px"><h2 id="1-matching-nodes">1. Matching nodes</h2><h3 id="11-get-all-nodes">1.1 Get all nodes</h3><p>Without specifying labels, the query will return all the nodes in a graph.</p><pre><code class="language-cypher">MATCH (n) 
RETURN n;
</code></pre><p>Output:</p><pre><code>+-----------------------------------------------------------------------------------------------------+
| n                                                                                                   |
+-----------------------------------------------------------------------------------------------------+
| (:Country {continent: &quot;Europe&quot;, language: &quot;German&quot;, name: &quot;Germany&quot;, population: 83000000})         |
| (:Country {continent: &quot;Europe&quot;, language: &quot;French&quot;, name: &quot;France&quot;, population: 67000000})          |
| (:Country {continent: &quot;Europe&quot;, language: &quot;English&quot;, name: &quot;United Kingdom&quot;, population: 66000000}) |
| (:Person {name: &quot;John&quot;})                                                                            |
| (:Person {name: &quot;Harry&quot;})                                                                           |
| (:Person {name: &quot;Anna&quot;})                                                                            |
+-----------------------------------------------------------------------------------------------------+
</code></pre><h3 id="12-get-all-nodes-with-a-label">1.2 Get all nodes with a label</h3><p>By specifying the label of a node, all the nodes with that label are returned.</p><pre><code class="language-cypher">MATCH (c:Country)
RETURN c;
</code></pre><p>Output:</p><pre><code>+-----------------------------------------------------------------------------------------------------+
| c                                                                                                   |
+-----------------------------------------------------------------------------------------------------+
| (:Country {continent: &quot;Europe&quot;, language: &quot;German&quot;, name: &quot;Germany&quot;, population: 83000000})         |
| (:Country {continent: &quot;Europe&quot;, language: &quot;French&quot;, name: &quot;France&quot;, population: 67000000})          |
| (:Country {continent: &quot;Europe&quot;, language: &quot;English&quot;, name: &quot;United Kingdom&quot;, population: 66000000}) |
+-----------------------------------------------------------------------------------------------------+
</code></pre><h2 id="2-matching-relationships">2. Matching relationships</h2><h3 id="21-get-all-related-nodes">2.1 Get all related nodes</h3><p>By using the <em>related to</em> symbol <code>--</code>, nodes that have a relationship with the specified node can be returned.
The symbol represents an undirected relationship which means the direction of the relationship is not taken into account.</p><pre><code class="language-cypher">MATCH (:Person { name: &#x27;John&#x27; })--(n)
RETURN n;
</code></pre><p>Output:</p><pre><code>+---------------------------------------------------------------------------------------------+
| n                                                                                           |
+---------------------------------------------------------------------------------------------+
| (:Person {name: &quot;Anna&quot;})                                                                    |
| (:Country {continent: &quot;Europe&quot;, language: &quot;French&quot;, name: &quot;France&quot;, population: 67000000})  |
| (:Country {continent: &quot;Europe&quot;, language: &quot;German&quot;, name: &quot;Germany&quot;, population: 83000000}) |
| (:Person {name: &quot;Harry&quot;})                                                                   |
+---------------------------------------------------------------------------------------------+
</code></pre><h3 id="22-get-related-nodes-with-a-label">2.2 Get related nodes with a label</h3><p>To only return <em>related to</em> nodes with a specific label you need to add it using the label syntax.</p><pre><code class="language-cypher">MATCH (:Person { name: &#x27;John&#x27; })--(p:Person)
RETURN p;
</code></pre><p>Output:</p><pre><code>+---------------------------+
| p                         |
+---------------------------+
| (:Person {name: &quot;Harry&quot;}) |
| (:Person {name: &quot;Anna&quot;})  |
+---------------------------+
</code></pre><h3 id="23-get-related-nodes-with-a-directed-relationship">2.3 Get related nodes with a directed relationship</h3><p>The <em>related to</em> symbol <code>--</code> can be extended by using:</p><ul><li><code>--&gt;</code> to specify outgoing relationships,</li><li><code>&lt;--</code> to specify ingoing relationships.</li></ul><pre><code class="language-cypher">MATCH (:Country { name: &#x27;France&#x27; })&lt;--(p:Person)
RETURN p;
</code></pre><p>Output:</p><pre><code>+--------------------------+
| p                        |
+--------------------------+
| (:Person {name: &quot;John&quot;}) |
+--------------------------+
</code></pre><h3 id="24-get-a-relationship">2.4 Get a relationship</h3><p>If you want to return the relationship between two nodes or a property of the relationship, a variable is required.
A directed or undirected relationship can be used.</p><p>This query returns the relationship and its type:</p><pre><code class="language-cypher">MATCH (:Person { name: &#x27;John&#x27; })-[r]-&gt;()
RETURN type(r);
</code></pre><p>Output:</p><pre><code>+--------------+
| type(r)      |
+--------------+
| WORKING_IN   |
| LIVING_IN    |
| FRIENDS_WITH |
+--------------+
</code></pre><p>This query also returns the property <code>date_of_start</code> of the relationship:</p><pre><code class="language-cypher">MATCH (:Person { name: &#x27;John&#x27; })-[r]-&gt;()
RETURN type(r), r.date_of_start;
</code></pre><p>Output:</p><pre><code>+-----------------+-----------------+
| type(r)         | r.date_of_start |
+-----------------+-----------------+
| WORKING_IN      | 2014            |
| LIVING_IN       | 2014            |
| FRIENDS_WITH    | 2011            |
+-----------------+-----------------+
</code></pre><h3 id="25-matching-on-a-relationship-with-a-type">2.5 Matching on a relationship with a type</h3><p>To return a relationship with a specified type you need to use the type syntax.
A directed or undirected relationship can be used.</p><pre><code class="language-cypher">MATCH (p:Person { name: &#x27;John&#x27; })-[:LIVING_IN]-(c)
RETURN c.name;
</code></pre><p>Output:</p><pre><code>+---------+
| c.name  |
+---------+
| Germany |
+---------+
</code></pre><h3 id="26-matching-on-relationships-with-multiple-types">2.6 Matching on relationships with multiple types</h3><p>To return relationships with any of the specified types, the types need to be chained together with the pipe symbol <code>|</code>.</p><pre><code class="language-cypher">MATCH (p:Person { name: &#x27;John&#x27; })-[:LIVING_IN|:WORKING_IN]-(c)
RETURN c.name;
</code></pre><p>Output:</p><pre><code>+---------+
| c.name  |
+---------+
| France  |
| Germany |
+---------+
</code></pre><h3 id="27-uncommon-characters-in-relationship-types">2.7 Uncommon characters in relationship types</h3><p>If a type has non-letter characters, like spaces, for example, the backtick symbol ` needs to be used to quote these.
If the relationship type <code>LIVING_IN</code> had a space instead of an underscore, a possible query would look like this.</p><pre><code class="language-cypher">MATCH (:Country { name: &#x27;France&#x27; })&lt;-[r:`LIVING IN`]-()
RETURN r.name;
</code></pre><h3 id="28-match-with-multiple-relationships">2.8 Match with multiple relationships</h3><p>Multiple relationship statements can be specified in the query.</p><pre><code class="language-cypher">MATCH (:Country { name: &#x27;France&#x27; })&lt;-[l:WORKING_IN]-(p)-[w:LIVING_IN]-&gt;(:Country { name: &#x27;Germany&#x27; })
RETURN p.name;
</code></pre><p>Output:</p><pre><code>+--------+
| p.name |
+--------+
| John   |
+--------+
</code></pre><h2 id="3-matching-with-variable-length-relationships">3. Matching with variable length relationships</h2><h3 id="31-variable-length-relationships">3.1 Variable length relationships</h3><p>If a node needs to be specified by its distance in relationship→node hops, the following syntax is used: <code>-[:TYPE*minHops..maxHops]→</code>.
minHops and maxHops are optional and default to 1 and infinity respectively. The dots can be omitted if both are not specified or if
only one is set which implies a fixed length pattern.</p><pre><code class="language-cypher">MATCH ({ name: &#x27;United Kingdom&#x27; })-[:LIVING_IN*1..2]-(n)
RETURN n;
</code></pre><p>Output:</p><pre><code>+---------------------------------------------------------------------------------------------+
| n                                                                                           |
+---------------------------------------------------------------------------------------------+
| (:Person {name: &quot;Harry&quot;})                                                                   |
| (:Person {name: &quot;Anna&quot;})                                                                    |
| (:Country {continent: &quot;Europe&quot;, language: &quot;German&quot;, name: &quot;Germany&quot;, population: 83000000}) |
+---------------------------------------------------------------------------------------------+
</code></pre><h3 id="32-variable-length-relationships-with-multiple-relationship-types">3.2 Variable length relationships with multiple relationship types</h3><p>If variable lengths are used with multiple stacked up relationship types, <code>*minHops..maxHops</code> applies to any combination of relationships.</p><pre><code class="language-cypher">MATCH ({ name: &#x27;United Kingdom&#x27; })&lt;-[:WORKING_IN|FRIENDS_WITH*1..2]-(P:Person)
RETURN P;
</code></pre><p>Output:</p><pre><code>+---------------------------+
| P                         |
+---------------------------+
| (:Person {name: &quot;John&quot;})  |
| (:Person {name: &quot;Harry&quot;}) |
| (:Person {name: &quot;Anna&quot;})  |
+---------------------------+
</code></pre><h3 id="33-returning-multiple-relationships-with-variable-length">3.3 Returning multiple relationships with variable length</h3><p>If a variable length is used, the list of relationships can be returned by adding <code>variable=</code> at the beginning of the <code>MATCH</code> clause.</p><pre><code class="language-cypher">MATCH p=({ name: &#x27;John&#x27; })&lt;-[:FRIENDS_WITH*1..2]-()
RETURN relationships(p);
</code></pre><p>Output:</p><pre><code>+----------------------------------------+
| relationships(p)                       |
+----------------------------------------+
| [[FRIENDS_WITH {date_of_start: 2012}]] |
+----------------------------------------+
</code></pre><h2 id="data-set-queries">Data set Queries</h2><p>We encourage you to try out the examples by yourself.
You can get our data set locally by executing the following query block.</p><pre><code class="language-cypher">MATCH (n) DETACH DELETE n;

CREATE (c1:Country { name: &#x27;Germany&#x27;, language: &#x27;German&#x27;, continent: &#x27;Europe&#x27;, population: 83000000 });
CREATE (c2:Country { name: &#x27;France&#x27;, language: &#x27;French&#x27;, continent: &#x27;Europe&#x27;, population: 67000000 });
CREATE (c3:Country { name: &#x27;United Kingdom&#x27;, language: &#x27;English&#x27;, continent: &#x27;Europe&#x27;, population: 66000000 });

MATCH (c1),(c2)
WHERE c1.name= &#x27;Germany&#x27; AND c2.name = &#x27;France&#x27;
CREATE (c2)&lt;-[:WORKING_IN { date_of_start: 2014 }]-(p:Person { name: &#x27;John&#x27; })-[:LIVING_IN { date_of_start: 2014 }]-&gt;(c1);

MATCH (c)
WHERE c.name= &#x27;United Kingdom&#x27;
CREATE (c)&lt;-[:WORKING_IN { date_of_start: 2014 }]-(p:Person { name: &#x27;Harry&#x27; })-[:LIVING_IN { date_of_start: 2013 }]-&gt;(c);

MATCH (p1),(p2)
WHERE p1.name = &#x27;John&#x27; AND p2.name = &#x27;Harry&#x27;
CREATE (p1)-[:FRIENDS_WITH { date_of_start: 2011 }]-&gt;(p2);

MATCH (p1),(p2)
WHERE p1.name = &#x27;John&#x27; AND p2.name = &#x27;Harry&#x27;
CREATE (p1)&lt;-[:FRIENDS_WITH { date_of_start: 2012 }]-(:Person { name: &#x27;Anna&#x27; })-[:FRIENDS_WITH { date_of_start: 2014 }]-&gt;(p2);

MATCH (p),(c1),(c2)
WHERE p.name = &#x27;Anna&#x27; AND c1.name = &#x27;United Kingdom&#x27; AND c2.name = &#x27;Germany&#x27;
CREATE (c2)&lt;-[:LIVING_IN { date_of_start: 2014 }]-(p)-[:LIVING_IN { date_of_start: 2014 }]-&gt;(c1);

MATCH (n)-[r]-&gt;(m) RETURN n,r,m;
</code></pre></div></article><div class="margin-vert--xl"><div class="row"><div class="col"><a href="https://github.com/memgraph/docs/tree/main/cypher-manual/clauses/match.md" target="_blank" rel="noreferrer noopener"><svg fill="currentColor" height="1.2em" width="1.2em" preserveAspectRatio="xMidYMid meet" role="img" viewBox="0 0 40 40" class="iconEdit_2LL7"><g><path d="m34.5 11.7l-3 3.1-6.3-6.3 3.1-3q0.5-0.5 1.2-0.5t1.1 0.5l3.9 3.9q0.5 0.4 0.5 1.1t-0.5 1.2z m-29.5 17.1l18.4-18.5 6.3 6.3-18.4 18.4h-6.3v-6.2z"></path></g></svg>Edit this page</a></div></div></div><div class="margin-vert--lg"><nav class="pagination-nav" aria-label="Blog list page navigation"><div class="pagination-nav__item"><a class="pagination-nav__link" href="/cypher-manual/clauses/delete"><div class="pagination-nav__sublabel">Previous</div><div class="pagination-nav__label">« DELETE clause</div></a></div><div class="pagination-nav__item pagination-nav__item--next"><a class="pagination-nav__link" href="/cypher-manual/clauses/merge"><div class="pagination-nav__sublabel">Next</div><div class="pagination-nav__label">MERGE clause »</div></a></div></nav></div></div></div><div class="col col--3"><div class="tableOfContents_2xL- thin-scrollbar"><ul class="table-of-contents table-of-contents__left-border"><li><a href="#data-set" class="table-of-contents__link">Data Set</a></li><li><a href="#1-matching-nodes" class="table-of-contents__link">1. Matching nodes</a><ul><li><a href="#11-get-all-nodes" class="table-of-contents__link">1.1 Get all nodes</a></li><li><a href="#12-get-all-nodes-with-a-label" class="table-of-contents__link">1.2 Get all nodes with a label</a></li></ul></li><li><a href="#2-matching-relationships" class="table-of-contents__link">2. Matching relationships</a><ul><li><a href="#21-get-all-related-nodes" class="table-of-contents__link">2.1 Get all related nodes</a></li><li><a href="#22-get-related-nodes-with-a-label" class="table-of-contents__link">2.2 Get related nodes with a label</a></li><li><a href="#23-get-related-nodes-with-a-directed-relationship" class="table-of-contents__link">2.3 Get related nodes with a directed relationship</a></li><li><a href="#24-get-a-relationship" class="table-of-contents__link">2.4 Get a relationship</a></li><li><a href="#25-matching-on-a-relationship-with-a-type" class="table-of-contents__link">2.5 Matching on a relationship with a type</a></li><li><a href="#26-matching-on-relationships-with-multiple-types" class="table-of-contents__link">2.6 Matching on relationships with multiple types</a></li><li><a href="#27-uncommon-characters-in-relationship-types" class="table-of-contents__link">2.7 Uncommon characters in relationship types</a></li><li><a href="#28-match-with-multiple-relationships" class="table-of-contents__link">2.8 Match with multiple relationships</a></li></ul></li><li><a href="#3-matching-with-variable-length-relationships" class="table-of-contents__link">3. Matching with variable length relationships</a><ul><li><a href="#31-variable-length-relationships" class="table-of-contents__link">3.1 Variable length relationships</a></li><li><a href="#32-variable-length-relationships-with-multiple-relationship-types" class="table-of-contents__link">3.2 Variable length relationships with multiple relationship types</a></li><li><a href="#33-returning-multiple-relationships-with-variable-length" class="table-of-contents__link">3.3 Returning multiple relationships with variable length</a></li></ul></li><li><a href="#data-set-queries" class="table-of-contents__link">Data set Queries</a></li></ul></div></div></div></div></main></div></div><footer class="footer footer--dark"><div class="container"><div class="row footer__links"><div class="col footer__col"><h4 class="footer__title">Documentation</h4><ul class="footer__items"><li class="footer__item"><a class="footer__link-item" href="/memgraph/overview">Memgraph DB</a></li><li class="footer__item"><a class="footer__link-item" href="/memgraph-lab">Memgraph Lab</a></li><li class="footer__item"><a class="footer__link-item" href="/memgraph-cloud">Memgraph Cloud</a></li><li class="footer__item"><a class="footer__link-item" href="/cypher-manual">Cypher manual</a></li></ul></div><div class="col footer__col"><h4 class="footer__title">Community</h4><ul class="footer__items"><li class="footer__item"><a href="https://stackoverflow.com/questions/tagged/memgraphdb" target="_blank" rel="noopener noreferrer" class="footer__link-item">Stack Overflow</a></li><li class="footer__item"><a href="https://discourse.memgraph.com" target="_blank" rel="noopener noreferrer" class="footer__link-item">Developer Forum</a></li><li class="footer__item"><a href="https://twitter.com/memgraphdb" target="_blank" rel="noopener noreferrer" class="footer__link-item">Twitter</a></li></ul></div><div class="col footer__col"><h4 class="footer__title">More</h4><ul class="footer__items"><li class="footer__item"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="footer__link-item">GitHub</a></li><li class="footer__item"><a href="https://www.youtube.com/channel/UCZ3HOJvHGxtQ_JHxOselBYg" target="_blank" rel="noopener noreferrer" class="footer__link-item">Youtube</a></li></ul></div></div><div class="footer__bottom text--center"><div class="margin-bottom--sm"><a href="https://memgraph.com" target="_blank" rel="noopener noreferrer" class="footerLogoLink_31Aa"><img class="footer__logo" alt="Memgraph Logo" src="/img/Memgraph-logo-white-rgb.png"></a></div><div class="footer__copyright">Copyright © 2021 Memgraph. Built by developers, for developers!</div></div></div></footer></div>
<script src="/styles.06f88032.js"></script>
<script src="/runtime~main.709d9e6c.js"></script>
<script src="/main.afc0a334.js"></script>
<script src="/1.0ef0cd43.js"></script>
<script src="/2.cec97469.js"></script>
<script src="/123.885e8308.js"></script>
<script src="/126.8348d2a6.js"></script>
<script src="/08713178.0c1b649c.js"></script>
<script src="/17896441.a596db69.js"></script>
<script src="/70ee916e.41e7ce23.js"></script>
</body>
</html>