<!doctype html>
<html lang="en">
<head>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<meta name="generator" content="Docusaurus v2.0.0-alpha.70">
<link rel="alternate" type="application/rss+xml" href="/blog/rss.xml" title="Memgraph Docs Blog RSS Feed">
<link rel="alternate" type="application/atom+xml" href="/blog/atom.xml" title="Memgraph Docs Blog Atom Feed">
<script src="https://docs.memgraph.com/js/analytics.js"></script><title data-react-helmet="true">MERGE clause | Memgraph Docs</title><meta data-react-helmet="true" name="twitter:card" content="summary_large_image"><meta data-react-helmet="true" name="docusaurus_locale" content="en"><meta data-react-helmet="true" name="docusaurus_version" content="current"><meta data-react-helmet="true" name="docusaurus_tag" content="docs-cypher-manual-current"><meta data-react-helmet="true" property="og:title" content="MERGE clause | Memgraph Docs"><meta data-react-helmet="true" name="description" content="The MERGE clause is used to ensure that a pattern you are looking for exists in the database. This means that if the pattern is not found, it will be created. In a way, this clause is like a combination of MATCH and CREATE."><meta data-react-helmet="true" property="og:description" content="The MERGE clause is used to ensure that a pattern you are looking for exists in the database. This means that if the pattern is not found, it will be created. In a way, this clause is like a combination of MATCH and CREATE."><meta data-react-helmet="true" property="og:url" content="https://docs.memgraph.com/cypher-manual/clauses/merge"><link data-react-helmet="true" rel="shortcut icon" href="/img/social-logo-round-corners.png"><link data-react-helmet="true" rel="canonical" href="https://docs.memgraph.com/cypher-manual/clauses/merge"><link rel="stylesheet" href="/styles.e539ad93.css">
<link rel="preload" href="/styles.e1fc5b56.js" as="script">
<link rel="preload" href="/runtime~main.435efa94.js" as="script">
<link rel="preload" href="/main.2df314f9.js" as="script">
<link rel="preload" href="/1.c8aa7cb6.js" as="script">
<link rel="preload" href="/2.20a8b576.js" as="script">
<link rel="preload" href="/122.2ceb147c.js" as="script">
<link rel="preload" href="/123.cf4e4011.js" as="script">
<link rel="preload" href="/08713178.12a7c9ab.js" as="script">
<link rel="preload" href="/17896441.33a2d82b.js" as="script">
<link rel="preload" href="/898fa4a6.5832d4fd.js" as="script">
</head>
<body>
<script>!function(){function t(t){document.documentElement.setAttribute("data-theme",t)}var e=function(){var t=null;try{t=localStorage.getItem("theme")}catch(t){}return t}();t(null!==e?e:"light")}()</script><div id="__docusaurus">
<nav aria-label="Skip navigation links"><button type="button" tabindex="0" class="skipToContent_11B0">Skip to main content</button></nav><nav class="navbar navbar--fixed-top"><div class="navbar__inner"><div class="navbar__items"><div aria-label="Navigation bar toggle" class="navbar__toggle" role="button" tabindex="0"><svg aria-label="Menu" width="30" height="30" viewBox="0 0 30 30" role="img" focusable="false"><title>Menu</title><path stroke="currentColor" stroke-linecap="round" stroke-miterlimit="10" stroke-width="2" d="M4 7h22M4 15h22M4 23h22"></path></svg></div><a class="navbar__brand" href="/"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--light_3CMI navbar__logo"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--dark_3ARp navbar__logo"><strong class="navbar__title">Docs</strong></a><div class="navbar__item dropdown dropdown--hoverable dropdown--left"><a class="navbar__item navbar__link" href="/memgraph/overview">Memgraph DB</a><ul class="dropdown__menu"><li><a class="dropdown__link" href="/memgraph/getting-started">Getting started</a></li><li><a class="dropdown__link" href="/memgraph/getting-started/installation">Installation</a></li><li><a class="dropdown__link" href="/memgraph/database-functionalities">Database functionalities</a></li><li><a class="dropdown__link" href="/memgraph/getting-started/connecting-applications">Building applications</a></li><li><a class="dropdown__link" href="/memgraph/reference-guide">Reference guide</a></li></ul></div><a class="navbar__item navbar__link" href="/memgraph-lab/">Memgraph Lab</a><a class="navbar__item navbar__link" href="/memgraph-cloud/">Memgraph Cloud</a><div class="navbar__item dropdown dropdown--hoverable dropdown--left"><a aria-current="page" class="navbar__item navbar__link navbar__link--active" href="/cypher-manual/">Cypher manual</a><ul class="dropdown__menu"><li><a aria-current="page" class="dropdown__link dropdown__link--active" href="/cypher-manual/">Overview</a></li><li><a class="dropdown__link" href="/cypher-manual/functions">Functions</a></li><li><a aria-current="page" class="dropdown__link dropdown__link--active" href="/cypher-manual/clauses">Clauses</a></li><li><a class="dropdown__link" href="/cypher-manual/other-features">Other features</a></li><li><a class="dropdown__link" href="/cypher-manual/differences">Differences</a></li></ul></div></div><div class="navbar__items navbar__items--right"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="navbar__item navbar__link">GitHub</a><div class="react-toggle react-toggle--disabled displayOnlyInLargeViewport_2N3Q"><div class="react-toggle-track"><div class="react-toggle-track-check"><span class="toggle_3NWk">🌜</span></div><div class="react-toggle-track-x"><span class="toggle_3NWk">🌞</span></div></div><div class="react-toggle-thumb"></div><input type="checkbox" disabled="" aria-label="Dark mode toggle" class="react-toggle-screenreader-only"></div></div></div><div role="presentation" class="navbar-sidebar__backdrop"></div><div class="navbar-sidebar"><div class="navbar-sidebar__brand"><a class="navbar__brand" href="/"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--light_3CMI navbar__logo"><img src="/img/social-logo-round-corners.png" alt="Memgraph Logo" class="themedImage_YANc themedImage--dark_3ARp navbar__logo"><strong class="navbar__title">Docs</strong></a></div><div class="navbar-sidebar__items"><div class="menu"><ul class="menu__list"><li class="menu__list-item menu__list-item--collapsed"><a class="menu__link menu__link--sublist" role="button" href="/memgraph/overview">Memgraph DB</a><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started">Getting started</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started/installation">Installation</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/database-functionalities">Database functionalities</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/getting-started/connecting-applications">Building applications</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph/reference-guide">Reference guide</a></li></ul></li><li class="menu__list-item"><a class="menu__link" href="/memgraph-lab/">Memgraph Lab</a></li><li class="menu__list-item"><a class="menu__link" href="/memgraph-cloud/">Memgraph Cloud</a></li><li class="menu__list-item menu__list-item--collapsed"><a aria-current="page" class="menu__link menu__link--sublist navbar__link--active" role="button" href="/cypher-manual/">Cypher manual</a><ul class="menu__list"><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active" href="/cypher-manual/">Overview</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/functions">Functions</a></li><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active" href="/cypher-manual/clauses">Clauses</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/other-features">Other features</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/differences">Differences</a></li></ul></li><li class="menu__list-item"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="menu__link">GitHub</a></li></ul></div></div></div></nav><div class="main-wrapper"><div class="docPage_vMrn"><div class="docSidebarContainer_3Ak5" role="complementary"><div class="sidebar_3gvy"><div class="menu menu--responsive thin-scrollbar menu_1yIk"><button aria-label="Open Menu" aria-haspopup="true" class="button button--secondary button--sm menu__button" type="button"><svg aria-label="Menu" class="sidebarMenuIcon_1CUI" width="24" height="24" viewBox="0 0 30 30" role="img" focusable="false"><title>Menu</title><path stroke="currentColor" stroke-linecap="round" stroke-miterlimit="10" stroke-width="2" d="M4 7h22M4 15h22M4 23h22"></path></svg></button><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/">Overview</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/reading-existing-data">Reading existing data</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/writing-new-data">Writing new data</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/reading-and-writing">Reading and writing</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/functions">Functions</a></li><li class="menu__list-item"><a class="menu__link menu__link--sublist menu__link--active" href="#!">Clauses</a><ul class="menu__list"><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses">Clauses overview</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/create">CREATE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/delete">DELETE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/match">MATCH</a></li><li class="menu__list-item"><a aria-current="page" class="menu__link menu__link--active active" tabindex="0" href="/cypher-manual/clauses/merge">MERGE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/optional-match">OPTIONAL MATCH</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/remove">REMOVE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/return">RETURN</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/set">SET</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/union">UNION</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/unwind">UNWIND</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/where">WHERE</a></li><li class="menu__list-item"><a class="menu__link" tabindex="0" href="/cypher-manual/clauses/with">WITH</a></li></ul></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/other-features">Other features</a></li><li class="menu__list-item"><a class="menu__link" href="/cypher-manual/differences">Differences</a></li></ul></div></div></div><main class="docMainContainer_2iGs"><div class="container padding-vert--lg docItemWrapper_1bxp"><div class="row"><div class="col docItemCol_U38p"><div class="docItemContainer_a7m4"><article><header><h1 class="docTitle_Oumm">MERGE clause</h1></header><div class="markdown"><p>The <code>MERGE</code> clause is used to ensure that a pattern you are looking for exists in the database. This means that if the pattern is not found, it will be created. In a way, this clause is like a combination of <code>MATCH</code> and <code>CREATE</code>.</p><ol><li><a href="#1-merging-nodes">Merging nodes</a><ol><li><a href="#11-merging-nodes-with-labels">Merging nodes with labels</a></li><li><a href="#12-merging-nodes-with-properties">Merging nodes with properties</a></li><li><a href="#13-merging-nodes-with-labels-and-properties">Merging nodes with labels and properties</a></li><li><a href="#14-merging-nodes-with-existing-node-properties">Merging nodes with existing node properties</a></li></ol></li><li><a href="#2-merging-relationships">Merging relationships</a><ol><li><a href="#21-merging-relationships">Merging relationships</a></li><li><a href="#22-merging-on-undirected-relationships">Merging on undirected relationships</a></li></ol></li><li><a href="#3-merging-with-on-create-and-on-match">Merging with ON CREATE and ON MATCH</a><ol><li><a href="#31-merging-with-on-create">Merging with ON CREATE</a></li><li><a href="#32-merging-with-on-match">Merging with ON MATCH</a></li><li><a href="#33-merging-with-on-create-and-on-match">Merging with ON CREATE and ON MATCH</a></li></ol></li></ol><h2 id="data-set">Data Set</h2><p>The following examples are executed with this data set. You can create this data set
locally by executing the queries at the end of the page: <a href="#data-set-queries">Data Set</a>.</p><img src="https://raw.githubusercontent.com/g-despot/images/master/data_set.png" alt="Data set" style="height:380px"><h2 id="1-merging-nodes">1. Merging nodes</h2><h3 id="11-merging-nodes-with-labels">1.1 Merging nodes with labels</h3><p>If <code>MERGE</code> is used on a node with a label that doesn&#x27;t exist in the database, the node is created.</p><pre><code class="language-cypher">MERGE (city:City)
RETURN city;
</code></pre><p>Output:</p><pre><code>+---------+
| city    |
+---------+
| (:City) |
+---------+
</code></pre><h3 id="12-merging-nodes-with-properties">1.2 Merging nodes with properties</h3><p>If <code>MERGE</code> is used on a node with properties that don&#x27;t match any existing node, that node is created.</p><pre><code class="language-cypher">MERGE (city { name: &#x27;London&#x27; })
RETURN city;
</code></pre><p>Output:</p><pre><code>+--------------------+
| city               |
+--------------------+
| ({name: &quot;London&quot;}) |
+--------------------+
</code></pre><h3 id="13-merging-nodes-with-labels-and-properties">1.3 Merging nodes with labels and properties</h3><p>If <code>MERGE</code> is used on a node with labels and properties that don&#x27;t match any existing node, that node is created.</p><pre><code class="language-cypher">MERGE (city:City { name: &#x27;London&#x27; })
RETURN city;
</code></pre><p>Output:</p><pre><code>+--------------------------+
| city                     |
+--------------------------+
| (:City {name: &quot;London&quot;}) |
+--------------------------+
</code></pre><h3 id="14-merging-nodes-with-existing-node-properties">1.4 Merging nodes with existing node properties</h3><p>If <code>MERGE</code> is used with properties on an existing node, a new node is created for each unique value of that property.</p><pre><code class="language-cypher">MATCH (p:Person)
MERGE (h:Human { name: p.name })
RETURN h.name;
</code></pre><p>Output:</p><pre><code>+--------+
| h.name |
+--------+
| John   |
| Harry  |
| Anna   |
+--------+
</code></pre><h2 id="2-merging-relationships">2. Merging relationships</h2><h3 id="21-merging-relationships">2.1 Merging relationships</h3><p>Just as with nodes, <code>MERGE</code> can be used to match or create relationships.</p><pre><code class="language-cypher">MATCH (p1:Person { name: &#x27;John&#x27; }), (p2:Person { name: &#x27;Anna&#x27; })
MERGE (p1)-[r:RELATED]-&gt;(p2)
RETURN r;
</code></pre><p>Output:</p><pre><code>+-----------+
| r         |
+-----------+
| [RELATED] |
+-----------+
</code></pre><p>Multiple relationships can be matched or created with <code>MERGE</code> in the same query.</p><pre><code class="language-cypher">MATCH (p1:Person { name: &#x27;John&#x27; }), (p2:Person { name: &#x27;Anna&#x27; })
MERGE (p1)-[r1:RELATED_TO]-&gt;(p2)-[r2:RELATED_TO]-&gt;(p1)
RETURN r1, r2;
</code></pre><p>Output:</p><pre><code>+--------------+--------------+
| r1           | r2           |
+--------------+--------------+
| [RELATED_TO] | [RELATED_TO] |
+--------------+--------------+
</code></pre><h3 id="22-merging-on-undirected-relationships">2.2 Merging on undirected relationships</h3><p>If <code>MERGE</code> is used on an undirected relationship, the direction will be chosen at random.</p><pre><code class="language-cypher">MATCH (p1:Person { name: &#x27;John&#x27; }), (p2:Person { name: &#x27;Anna&#x27; })
MERGE path=((p1)-[r:WORKS_WITH]-(p2))
RETURN path;
</code></pre><p>Output:</p><pre><code>+-----------------------------------------------------------------+
| p                                                               |
+-----------------------------------------------------------------+
| (:Person {name: &quot;John&quot;})-[WORKS_WITH]-&gt;(:Person {name: &quot;Anna&quot;}) |
+-----------------------------------------------------------------+
</code></pre><p>In this example, a path is returned to show the direction of the relationships.</p><h2 id="3-merging-with-on-create-and-on-match">3. Merging with <code>ON CREATE</code> and <code>ON MATCH</code></h2><h3 id="31-merging-with-on-create">3.1 Merging with <code>ON CREATE</code></h3><p>The <code>ON CREATE</code> part of a <code>MERGE</code> clause will only be executed if the node needs to be created.</p><pre><code class="language-cypher">MERGE (p:Person { name: &#x27;Lucille&#x27; })
ON CREATE SET p.date_of_creation = timestamp()
RETURN p.name, p.date_of_creation;
</code></pre><p>Output:</p><pre><code>+--------------------+--------------------+
| p.name             | p.date_of_creation |
+--------------------+--------------------+
| Lucille            | 1605080852685      |
+--------------------+--------------------+
</code></pre><h3 id="32-merging-with-on-match">3.2 Merging with <code>ON MATCH</code></h3><p>The <code>ON MATCH</code> part of a <code>MERGE</code> clause will only be executed if the node is found.</p><pre><code class="language-cypher">MERGE (p:Person { name: &#x27;John&#x27; })
ON MATCH SET p.found = TRUE
RETURN p.name, p.found;
</code></pre><p>Output:</p><pre><code>+---------+---------+
| p.name  | p.found |
+---------+---------+
| John    | true    |
+---------+---------+
</code></pre><h3 id="33-merging-with-on-create-and-on-match">3.3 Merging with <code>ON CREATE</code> and <code>ON MATCH</code></h3><p>The <code>MERGE</code> clause can be used with both the <code>ON CREATE</code> and <code>ON MATCH</code> options.</p><pre><code class="language-cypher">MERGE (p:Person { name: &#x27;Angela&#x27; })
ON CREATE SET p.notFound = TRUE
ON MATCH SET p.found = TRUE
RETURN p.name, p.notFound, p.found;
</code></pre><p>Output:</p><pre><code>+------------+------------+------------+
| p.name     | p.notFound | p.found    |
+------------+------------+------------+
| Angela     | true       | Null       |
+------------+------------+------------+
</code></pre><h2 id="data-set-queries">Data set Queries</h2><p>We encourage you to try out the examples by yourself.
You can get our data set locally by executing the following query block.</p><pre><code class="language-cypher">MATCH (n) DETACH DELETE n;

CREATE (c1:Country { name: &#x27;Germany&#x27;, language: &#x27;German&#x27;, continent: &#x27;Europe&#x27;, population: 83000000 });
CREATE (c2:Country { name: &#x27;France&#x27;, language: &#x27;French&#x27;, continent: &#x27;Europe&#x27;, population: 67000000 });
CREATE (c3:Country { name: &#x27;United Kingdom&#x27;, language: &#x27;English&#x27;, continent: &#x27;Europe&#x27;, population: 66000000 });

MATCH (c1),(c2)
WHERE c1.name= &#x27;Germany&#x27; AND c2.name = &#x27;France&#x27;
CREATE (c2)&lt;-[:WORKING_IN { date_of_start: 2014 }]-(p:Person { name: &#x27;John&#x27; })-[:LIVING_IN { date_of_start: 2014 }]-&gt;(c1);

MATCH (c)
WHERE c.name= &#x27;United Kingdom&#x27;
CREATE (c)&lt;-[:WORKING_IN { date_of_start: 2014 }]-(p:Person { name: &#x27;Harry&#x27; })-[:LIVING_IN { date_of_start: 2013 }]-&gt;(c);

MATCH (p1),(p2)
WHERE p1.name = &#x27;John&#x27; AND p2.name = &#x27;Harry&#x27;
CREATE (p1)-[:FRIENDS_WITH { date_of_start: 2011 }]-&gt;(p2);

MATCH (p1),(p2)
WHERE p1.name = &#x27;John&#x27; AND p2.name = &#x27;Harry&#x27;
CREATE (p1)&lt;-[:FRIENDS_WITH { date_of_start: 2012 }]-(:Person { name: &#x27;Anna&#x27; })-[:FRIENDS_WITH { date_of_start: 2014 }]-&gt;(p2);

MATCH (p),(c1),(c2)
WHERE p.name = &#x27;Anna&#x27; AND c1.name = &#x27;United Kingdom&#x27; AND c2.name = &#x27;Germany&#x27;
CREATE (c2)&lt;-[:LIVING_IN { date_of_start: 2014 }]-(p)-[:LIVING_IN { date_of_start: 2014 }]-&gt;(c1);

MATCH (n)-[r]-&gt;(m) RETURN n,r,m;
</code></pre></div></article><div class="margin-vert--xl"><div class="row"><div class="col"><a href="https://github.com/memgraph/docs/tree/master/cypher-manual/clauses/merge.md" target="_blank" rel="noreferrer noopener"><svg fill="currentColor" height="1.2em" width="1.2em" preserveAspectRatio="xMidYMid meet" role="img" viewBox="0 0 40 40" class="iconEdit_2LL7"><g><path d="m34.5 11.7l-3 3.1-6.3-6.3 3.1-3q0.5-0.5 1.2-0.5t1.1 0.5l3.9 3.9q0.5 0.4 0.5 1.1t-0.5 1.2z m-29.5 17.1l18.4-18.5 6.3 6.3-18.4 18.4h-6.3v-6.2z"></path></g></svg>Edit this page</a></div></div></div><div class="margin-vert--lg"><nav class="pagination-nav" aria-label="Blog list page navigation"><div class="pagination-nav__item"><a class="pagination-nav__link" href="/cypher-manual/clauses/match"><div class="pagination-nav__sublabel">Previous</div><div class="pagination-nav__label">« MATCH clause</div></a></div><div class="pagination-nav__item pagination-nav__item--next"><a class="pagination-nav__link" href="/cypher-manual/clauses/optional-match"><div class="pagination-nav__sublabel">Next</div><div class="pagination-nav__label">OPTIONAL MATCH clause »</div></a></div></nav></div></div></div><div class="col col--3"><div class="tableOfContents_2xL- thin-scrollbar"><ul class="table-of-contents table-of-contents__left-border"><li><a href="#data-set" class="table-of-contents__link">Data Set</a></li><li><a href="#1-merging-nodes" class="table-of-contents__link">1. Merging nodes</a><ul><li><a href="#11-merging-nodes-with-labels" class="table-of-contents__link">1.1 Merging nodes with labels</a></li><li><a href="#12-merging-nodes-with-properties" class="table-of-contents__link">1.2 Merging nodes with properties</a></li><li><a href="#13-merging-nodes-with-labels-and-properties" class="table-of-contents__link">1.3 Merging nodes with labels and properties</a></li><li><a href="#14-merging-nodes-with-existing-node-properties" class="table-of-contents__link">1.4 Merging nodes with existing node properties</a></li></ul></li><li><a href="#2-merging-relationships" class="table-of-contents__link">2. Merging relationships</a><ul><li><a href="#21-merging-relationships" class="table-of-contents__link">2.1 Merging relationships</a></li><li><a href="#22-merging-on-undirected-relationships" class="table-of-contents__link">2.2 Merging on undirected relationships</a></li></ul></li><li><a href="#3-merging-with-on-create-and-on-match" class="table-of-contents__link">3. Merging with <code>ON CREATE</code> and <code>ON MATCH</code></a><ul><li><a href="#31-merging-with-on-create" class="table-of-contents__link">3.1 Merging with <code>ON CREATE</code></a></li><li><a href="#32-merging-with-on-match" class="table-of-contents__link">3.2 Merging with <code>ON MATCH</code></a></li><li><a href="#33-merging-with-on-create-and-on-match" class="table-of-contents__link">3.3 Merging with <code>ON CREATE</code> and <code>ON MATCH</code></a></li></ul></li><li><a href="#data-set-queries" class="table-of-contents__link">Data set Queries</a></li></ul></div></div></div></div></main></div></div><footer class="footer footer--dark"><div class="container"><div class="row footer__links"><div class="col footer__col"><h4 class="footer__title">Documentation</h4><ul class="footer__items"><li class="footer__item"><a class="footer__link-item" href="/memgraph/overview">Memgraph DB</a></li><li class="footer__item"><a class="footer__link-item" href="/memgraph-lab">Memgraph Lab</a></li><li class="footer__item"><a class="footer__link-item" href="/memgraph-cloud">Memgraph Cloud</a></li><li class="footer__item"><a class="footer__link-item" href="/cypher-manual">Cypher manual</a></li></ul></div><div class="col footer__col"><h4 class="footer__title">Community</h4><ul class="footer__items"><li class="footer__item"><a href="https://stackoverflow.com/questions/tagged/memgraphdb" target="_blank" rel="noopener noreferrer" class="footer__link-item">Stack Overflow</a></li><li class="footer__item"><a href="https://discourse.memgraph.com" target="_blank" rel="noopener noreferrer" class="footer__link-item">Developer Forum</a></li><li class="footer__item"><a href="https://twitter.com/memgraphdb" target="_blank" rel="noopener noreferrer" class="footer__link-item">Twitter</a></li></ul></div><div class="col footer__col"><h4 class="footer__title">More</h4><ul class="footer__items"><li class="footer__item"><a href="https://github.com/memgraph" target="_blank" rel="noopener noreferrer" class="footer__link-item">GitHub</a></li><li class="footer__item"><a href="https://www.youtube.com/channel/UCZ3HOJvHGxtQ_JHxOselBYg" target="_blank" rel="noopener noreferrer" class="footer__link-item">Youtube</a></li></ul></div></div><div class="footer__bottom text--center"><div class="margin-bottom--sm"><a href="https://memgraph.com" target="_blank" rel="noopener noreferrer" class="footerLogoLink_31Aa"><img class="footer__logo" alt="Memgraph Logo" src="/img/Memgraph-logo-white-rgb.png"></a></div><div class="footer__copyright">Copyright © 2021 Memgraph. Built by developers, for developers!</div></div></div></footer></div>
<script src="/styles.e1fc5b56.js"></script>
<script src="/runtime~main.435efa94.js"></script>
<script src="/main.2df314f9.js"></script>
<script src="/1.c8aa7cb6.js"></script>
<script src="/2.20a8b576.js"></script>
<script src="/122.2ceb147c.js"></script>
<script src="/123.cf4e4011.js"></script>
<script src="/08713178.12a7c9ab.js"></script>
<script src="/17896441.33a2d82b.js"></script>
<script src="/898fa4a6.5832d4fd.js"></script>
</body>
</html>