---
id: run-a-query-module
title: Run a query module
sidebar_label: Run a query module (Python/C++)
---
import Tabs from '@theme/Tabs';
import TabItem from '@theme/TabItem';


## Prerequisites
- **You have developed query module by yourself, or followed our tutorial for Python or C++**

## Importing in Memgraph

<Tabs
  groupId="running-method"
  defaultValue="docker-hub"
  values={[
    {label: 'Docker Hub', value: 'docker-hub'},
    {label: 'Docker build', value: 'docker'},
    {label: 'Install from source on Linux', value: 'source'},
  ]
}>
  <TabItem value="docker-hub">

**1.** First download memgraph/memgraph-mage:1.0-dev image:

```
docker pull memgraph/memgraph-mage:1.0-dev
```

**2.** Start it:
```
docker run --rm -p 7687:7687 --name mage memgraph-mage:dev
```

**3.** And now we need to copy files inside container in order for Memgraph to import developed
query module.

**a)** First you need to copy files to container with name `mage`

```
docker cp . mage:/mage/
```

**b)** Then you need to position yourself inside container as root:

```
docker exec -u root -it mage /bin/bash
```

> Note: if you have done build locally, make sure to delete folder `cpp/build` because
> you might be dealing with different `architectures` or problems with `CMakeCache.txt`.
> To delete it, run:
>
> `rm -rf cpp/build`

**c)** After that run build with option to copy executables from `mage/dist` to `/usr/lib/memgraph/query_modules`:

```
python3 setup build -p /usr/lib/memgraph/query_modules/
```
**d)** Everything is done now. Just run following command:

```
exit
```
** And that is it.**

  </TabItem>


  <TabItem value="docker">

**1.** To create `dev` **MAGE** image, run the following command:

```
docker build --target dev -t memgraph-mage:dev .
```
**2.** Now run the image with following command:

```
docker run --rm -p 7687:7687 --name mage memgraph-mage:dev
```

**And that is it.**

:::info
Now if you make any additional changes, you can stop container and do the rebuild.
Additionally if you don't want to rebuild everything again, you can have running container and copy stuff inside
container, do build inside container, and copy executables to  /usr/lib/memgraph/query_modules/ folder,
where Memgraph is looking for query modules. You can follow these steps for any additional changes:

**a)** First you need to copy files to container with name `mage`

```
docker cp . mage:/mage/
```

**b)** Then you need to position yourself inside container as root:

```
docker exec -u root -it mage /bin/bash
```

> Note: if you have done build locally, make sure to delete folder `cpp/build` because
> you might be dealing with different `architectures` or problems with `CMakeCache.txt`.
> To delete it, run:
>
> `rm -rf cpp/build`

**c)** After that, run build and copying `mage/dist` to `/usr/lib/memgraph/query_modules`:

```
python3 setup build -p /usr/lib/memgraph/query_modules/
```
**d)** Everything is done now. Just run following command:

```
exit
```
:::

  </TabItem>

  <TabItem value="source">
**0.** Make sure your Memgraph instance is running.

```
sudo systemctl status memgraph.service
```

**1.** Now, we need to copy our developed query module `random_walk` to `/usr/lib/memgraph/query_modules`.

```
python3 setup build -p /usr/lib/memgraph/query_modules
```

And that is it.
  </TabItem>
</Tabs>


## Querying

> Note that query modules are loaded into Memgraph on startup so if your instance was already running you will need to
> execute the following query inside one of [querying platforms](https://docs.memgraph.com/memgraph/connect-to-memgraph) to load them:
```
CALL mg.load_all();
```

Lastly, run a query and test your module:

```
MERGE (start:Node {id: 0})-[:RELATION]->(mid:Node {id: 1})-[:RELATION]->(end:Node {id: 2})
CALL random_walk.get(start, 2) YIELD path
RETURN path
```

## Testing

Test decoupled parts of your code that don't depend on Memgraph like you would
in any other setting. E2e (end to end) tests, on the other hand, depend on
internal Memgraph data structures, like nodes and edges. After running Memgraph,
we need to prepare the testing environment on the host machine. Position
yourself in the mage directory you cloned from GitHub. The expected folder
structure for each module is the following:

```
mage
└── e2e
    └── random_walk_test
        └── test_base
            ├── input.cyp
            └── test.yml
```

`input.cyp` represents a Cypher script for entering the data into the database.
To simplify this tutorial, we'll leave the database empty. `test.yml` specifies
which test query should be run by the database, and what should be the result or
exception. Create the files following the aforementioned directory structure.

### input.cyp

```cypher
MATCH (n) DETACH DELETE n;
```

### test.yml

```
query: >
  MATCH (start:Node {id: 0})
    CALL random_walk.get(start, 2) YIELD path
    RETURN path

output: []
```

Lastly, run the e2e tests with python:

```
python test_e2e
```
